In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import datasets  
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.tree import  DecisionTreeClassifier
from sklearn import tree
from sklearn.metrics import classification_report
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder

In [2]:
# import some data to play with
check = pd.read_csv(r"C:\Users\ADITYA\Desktop\EXCELR ASSIGNMENT\DECISION TREE\Fraud_check.csv")

In [3]:
check.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [4]:
check.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [5]:
check.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [6]:
# Renamning the data
check1 = check.rename({'Marital.Status':'Maritial_status','Taxable.Income':'Tax','City.Population':'City_population','Work.Experience':'Work_experience'},axis = 1)
check1

    Undergrad Maritial_status    Tax  City_population  Work_experience Urban
0          NO          Single  68833            50047               10   YES
1         YES        Divorced  33700           134075               18   YES
2          NO         Married  36925           160205               30   YES
3         YES          Single  50190           193264               15   YES
4          NO         Married  81002            27533               28    NO
..        ...             ...    ...              ...              ...   ...
595       YES        Divorced  76340            39492                7   YES
596       YES        Divorced  69967            55369                2   YES
597        NO        Divorced  47334           154058                0   YES
598       YES         Married  98592           180083               17    NO
599        NO        Divorced  96519           158137               16    NO

[600 rows x 6 columns]

In [7]:
check1.Undergrad.value_counts()

YES    312
NO     288
Name: Undergrad, dtype: int64

In [8]:
check1.Urban.value_counts()

YES    302
NO     298
Name: Urban, dtype: int64

In [9]:
check1.Maritial_status.value_counts()

Single      217
Married     194
Divorced    189
Name: Maritial_status, dtype: int64

In [10]:
label_encoder = preprocessing.LabelEncoder()
check1['Undergrad']= label_encoder.fit_transform(check1['Undergrad'])

In [11]:
check['Undergrad'].value_counts()

YES    312
NO     288
Name: Undergrad, dtype: int64

In [12]:
label_encoder = preprocessing.LabelEncoder()
check1['Urban']= label_encoder.fit_transform(check1['Urban'])

In [13]:
check1['Urban'].value_counts()

1    302
0    298
Name: Urban, dtype: int64

In [14]:
label_encoder = preprocessing.LabelEncoder()
check1['Maritial_status']= label_encoder.fit_transform(check1['Maritial_status'])

In [15]:
check1['Maritial_status'].value_counts()

2    217
1    194
0    189
Name: Maritial_status, dtype: int64

In [16]:
# printing all columns of the dataframe\
check1.columns

Index(['Undergrad', 'Maritial_status', 'Tax', 'City_population',
       'Work_experience', 'Urban'],
      dtype='object')

In [17]:
check1["taxable_income"]="GOOD"
check1.loc[check1["Tax"]<=30000,"taxable_income"]="Risky"
check1.drop(['Tax'],axis = 1,inplace = True)

In [18]:
check1

,Undergrad,Maritial_status,City_population,Work_experience,Urban,taxable_income
0,0,2,50047,10,1,GOOD
1,1,0,134075,18,1,GOOD
2,0,1,160205,30,1,GOOD
3,1,2,193264,15,1,GOOD
4,0,1,27533,28,0,GOOD
...,...,...,...,...,...,...
595,1,0,39492,7,1,GOOD
596,1,0,55369,2,1,GOOD
597,0,0,154058,0,1,GOOD
598,1,1,180083,17,0,GOOD
599,0,0,158137,16,0,GOOD

In [ ]:
check1.

In [19]:
check1['taxable_income'].value_counts()

GOOD     476
Risky    124
Name: taxable_income, dtype: int64

In [20]:
x=company.iloc[:,0:10]
y=company['sales']

NameError: name 'company' is not defined

In [ ]:
x

In [ ]:
y

In [ ]:
company['sales'].unique()

In [ ]:
company.sales.value_counts()

In [ ]:
company.columns

In [ ]:
colnames = list(company.columns)
colnames

In [ ]:
# Splitting data into training and testing data set
x_train, x_test,y_train,y_test = train_test_split(x,y, test_size=0.2,random_state=40)

In [ ]:
x_train

In [ ]:
y_train

### Building Decision Tree Classifier using Entropy Criteria

In [ ]:
model = DecisionTreeClassifier(criterion = 'entropy',max_depth=3)
model.fit(x_train,y_train)

In [ ]:
#PLot the decision tree
fig = plt.figure(figsize=(18,9))
tree.plot_tree(model);

In [ ]:
y_train.value_counts()

In [ ]:
fn=['CompPrice', 'Income', 'Advertising', 'Population', 'Price',
       'ShelveLoc', 'Age', 'Education', 'Urban', 'US']
cn=['large','small']
fig, axes = plt.subplots(nrows = 1,ncols = 1,figsize = (4,4), dpi=300)
tree.plot_tree(model,
               feature_names = fn, 
               class_names=cn,
               filled = True);

In [ ]:
pred_train = model.predict(x_train)

In [ ]:
#Predicting on test data
preds = model.predict(x_test) # predicting on test data set 
pd.Series(preds).value_counts() # getting the count of each category

In [ ]:
y_test

In [ ]:
preds

In [ ]:
pd.crosstab(y_test,preds) # getting the 2 way table to understand the correct and wrong predictions

In [ ]:
# Accuracy 
np.mean(preds==y_test)

In [ ]:
y_test[127:]